Tekla Open API Reference for Tekla Structures 2025
WpfProfileCatalog.SelectionDone Event
 The SelectionDone event is raised when the selection has been done.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler SelectionDone
Public Event SelectionDone As EventHandler
Value
Type: System.EventHandler
Remarks
 Please note that when filling in controls programmatically, use registered attribute.
See Also
Reference
WpfProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace